load-tests/scenarios/D-multiple-rooms-10.yml
# Cenário D2: 10 salas simultâneas
config:
  target: "http://localhost:3000"
  phases:
    - name: "10 rooms"
      duration: 60
      arrivalRate: 1
  engines:
    socketio-v3: {}
  processor: "../functions.js"

scenarios:
  - name: "Host cria sala"
    engine: socketio-v3
    flow:
      - function: "setHostId"
      - connect:
          auth:
            hostId: "{{ hostId }}"
      - emit:
          - "room:create"
          - questions:
              - text: "P1?"
                options: ["A", "B", "C", "D"]
                correctOptionIndex: 0
              - text: "P2?"
                options: ["A", "B", "C", "D"]
                correctOptionIndex: 1
              - text: "P3?"
                options: ["A", "B", "C", "D"]
                correctOptionIndex: 2
              - text: "P4?"
                options: ["A", "B", "C", "D"]
                correctOptionIndex: 3
              - text: "P5?"
                options: ["A", "B", "C", "D"]
                correctOptionIndex: 0
        response:
          on: "room:created"