load-tests/scenarios/D-multiple-rooms.yml
# Cenário D: Múltiplas salas
# K hosts criam K salas simultaneamente
# Métricas: isolamento entre salas, uso de memória, CPU
#
# D1: 5 salas (5 hosts em 30s)
# D2: 10 salas (10 hosts em 60s)
#
# Para testar K salas x M participantes: rodar create-room com K,
# depois usar load-tests/run-multi-rooms.js (cria K salas, distribui M participantes)

config:
  target: "http://localhost:3000"
  phases:
    - name: "5 rooms"
      duration: 30
      arrivalRate: 1
  engines:
    socketio-v3: {}
  processor: "../functions.js"

scenarios:
  - name: "Host cria sala"
    engine: socketio-v3
    flow:
      - function: "setHostId"
      - connect:
          auth:
            hostId: "{{ hostId }}"
      - emit:
          - "room:create"
          - questions:
              - text: "P1?"
                options: ["A", "B", "C", "D"]
                correctOptionIndex: 0
              - text: "P2?"
                options: ["A", "B", "C", "D"]
                correctOptionIndex: 1
              - text: "P3?"
                options: ["A", "B", "C", "D"]
                correctOptionIndex: 2
              - text: "P4?"
                options: ["A", "B", "C", "D"]
                correctOptionIndex: 3
              - text: "P5?"
                options: ["A", "B", "C", "D"]
                correctOptionIndex: 0
        response:
          on: "room:created"